In [1]:
people = {
    "first" : ["Jacob","Jane","John"],
    "last" : ["Xi","Doe","Wick"],
    "email" : ["jacobxi@outlook.com","JaneDone@outlook.com", "JohnWick@outlook.com"]
}

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(people)

In [4]:
df

   first  last                 email
0  Jacob    Xi   jacobxi@outlook.com
1   Jane   Doe  JaneDone@outlook.com
2   John  Wick  JohnWick@outlook.com

In [22]:
df.columns = ['first_name','last_name','email']

In [23]:
df

  first_name last_name                 email
0      Jacob        Xi   jacobxi@outlook.com
1       Jane       Doe  JaneDone@outlook.com
2       John      Wick  JohnWick@outlook.com

In [24]:
df.columns = [x.upper() for x in df.columns]

In [25]:
df

  FIRST_NAME LAST_NAME                 EMAIL
0      Jacob        Xi   jacobxi@outlook.com
1       Jane       Doe  JaneDone@outlook.com
2       John      Wick  JohnWick@outlook.com

In [26]:
df.columns = df.columns.str.replace('_',' ')

In [27]:
df

  FIRST NAME LAST NAME                 EMAIL
0      Jacob        Xi   jacobxi@outlook.com
1       Jane       Doe  JaneDone@outlook.com
2       John      Wick  JohnWick@outlook.com

In [28]:
df.columns = df.columns.str.replace(' ','_')

In [29]:
df

  FIRST_NAME LAST_NAME                 EMAIL
0      Jacob        Xi   jacobxi@outlook.com
1       Jane       Doe  JaneDone@outlook.com
2       John      Wick  JohnWick@outlook.com

In [30]:
df.columns = [x.lower() for x in df.columns]

In [32]:
df.rename(columns={'first_name':'first', 'last_name':'last'},inplace=True)

In [33]:
df

   first  last                 email
0  Jacob    Xi   jacobxi@outlook.com
1   Jane   Doe  JaneDone@outlook.com
2   John  Wick  JohnWick@outlook.com

In [34]:
df.loc[2] = ['John','Smith','JohnSmith@email.com']
df

   first   last                 email
0  Jacob     Xi   jacobxi@outlook.com
1   Jane    Doe  JaneDone@outlook.com
2   John  Smith   JohnSmith@email.com

In [36]:
df.loc[2,['last','email']] = ['Wick','JohnWick@email.com']

In [37]:
df

   first  last                 email
0  Jacob    Xi   jacobxi@outlook.com
1   Jane   Doe  JaneDone@outlook.com
2   John  Wick    JohnWick@email.com

In [38]:
df.loc[2,'last']='Smith'

In [39]:
df

   first   last                 email
0  Jacob     Xi   jacobxi@outlook.com
1   Jane    Doe  JaneDone@outlook.com
2   John  Smith    JohnWick@email.com

In [40]:
df.at[2,'last']='Wick'
df

   first  last                 email
0  Jacob    Xi   jacobxi@outlook.com
1   Jane   Doe  JaneDone@outlook.com
2   John  Wick    JohnWick@email.com

In [44]:
filt = (df['email'] == 'JohnWick@email.com')
df[filt]['last'] = 'Smith'

/usr/local/lib/python3.7/site-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [45]:
df

   first  last                 email
0  Jacob    Xi   jacobxi@outlook.com
1   Jane   Doe  JaneDone@outlook.com
2   John  Wick    JohnWick@email.com

In [46]:
filt = (df['email'] == 'JohnWick@email.com')
df.loc[filt,'last'] = 'Smith'

In [47]:
df

   first   last                 email
0  Jacob     Xi   jacobxi@outlook.com
1   Jane    Doe  JaneDone@outlook.com
2   John  Smith    JohnWick@email.com

In [48]:
df['email'].str.lower()

0     jacobxi@outlook.com
1    janedone@outlook.com
2      johnwick@email.com
Name: email, dtype: object

In [49]:
df['email'] = df['email'].str.lower()
df

   first   last                 email
0  Jacob     Xi   jacobxi@outlook.com
1   Jane    Doe  janedone@outlook.com
2   John  Smith    johnwick@email.com

In [50]:
df['email'].apply(len)

0    19
1    20
2    18
Name: email, dtype: int64

In [51]:
def update_email(email):
    return email.upper()

In [52]:
df['email'] = df['email'].apply(update_email)

In [53]:
df

   first   last                 email
0  Jacob     Xi   JACOBXI@OUTLOOK.COM
1   Jane    Doe  JANEDONE@OUTLOOK.COM
2   John  Smith    JOHNWICK@EMAIL.COM

In [54]:
df['email'] = df['email'].apply(lambda x: x.lower())

In [55]:
df

   first   last                 email
0  Jacob     Xi   jacobxi@outlook.com
1   Jane    Doe  janedone@outlook.com
2   John  Smith    johnwick@email.com

In [57]:
df.apply(len, axis='columns')

0    3
1    3
2    3
dtype: int64

In [58]:
df.apply(pd.Series.min)

first                  Jacob
last                     Doe
email    jacobxi@outlook.com
dtype: object

In [60]:
df.apply(lambda x:x.min())

first                  Jacob
last                     Doe
email    jacobxi@outlook.com
dtype: object

In [62]:
df.applymap(len)

   first  last  email
0      5     2     19
1      4     3     20
2      4     5     18

In [64]:
df['first']=df['first'].replace({'Jane':'Mary'})

In [65]:
df['first']

0    Jacob
1     Mary
2     John
Name: first, dtype: object

In [66]:
df = pd.read_csv('data/survey_results_public.csv')
df

,Respondent,MainBranch,Hobbyist,OpenSourcer,OpenSource,Employment,Country,Student,EdLevel,UndergradMajor,...,WelcomeChange,SONewContent,Age,Gender,Trans,Sexuality,Ethnicity,Dependents,SurveyLength,SurveyEase
0,1,I am a student who is learning to code,Yes,Never,The quality of OSS and closed source software ...,"Not employed, and not looking for work",United Kingdom,No,Primary/elementary school,NaN,...,Just as welcome now as I felt last year,Tech articles written by other developers;Indu...,14.0,Man,No,Straight / Heterosexual,NaN,No,Appropriate in length,Neither easy nor difficult
1,2,I am a student who is learning to code,No,Less than once per year,The quality of OSS and closed source software ...,"Not employed, but looking for work",Bosnia and Herzegovina,"Yes, full-time","Secondary school (e.g. American high school, G...",NaN,...,Just as welcome now as I felt last year,Tech articles written by other developers;Indu...,19.0,Man,No,Straight / Heterosexual,NaN,No,Appropriate in length,Neither easy nor difficult
2,3,"I am not primarily a developer, but I write co...",Yes,Never,The quality of OSS and closed source software ...,Employed full-time,Thailand,No,"Bachelor’s degree (BA, BS, B.Eng., etc.)",Web development or web design,...,Just as welcome now as I felt last year,Tech meetups or events in your area;Courses on...,28.0,Man,No,Straight / Heterosexual,NaN,Yes,Appropriate in length,Neither easy nor difficult
3,4,I am a developer by profession,No,Never,The quality of OSS and closed source software ...,Employed full-time,United States,No,"Bachelor’s degree (BA, BS, B.Eng., etc.)","Computer science, computer engineering, or sof...",...,Just as welcome now as I felt last year,Tech articles written by other developers;Indu...,22.0,Man,No,Straight / Heterosexual,White or of European descent,No,Appropriate in length,Easy
4,5,I am a developer by profession,Yes,Once a month or more often,"OSS is, on average, of HIGHER quality than pro...",Employed full-time,Ukraine,No,"Bachelor’s degree (BA, BS, B.Eng., etc.)","Computer science, computer engineering, or sof...",...,Just as welcome now as I felt last year,Tech meetups or events in your area;Courses on...,30.0,Man,No,Straight / Heterosexual,White or of European descent;Multiracial,No,Appropriate in length,Easy
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
88878,88377,NaN,Yes,Less than once a month but more than once per ...,The quality of OSS and closed source software ...,"Not employed, and not looking for work",Canada,No,Primary/elementary school,NaN,...,NaN,Tech articles written by other developers;Tech...,NaN,Man,No,NaN,NaN,No,Appropriate in length,Easy
88879,88601,NaN,No,Never,The quality of OSS and closed source software ...,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
88880,88802,NaN,No,Never,NaN,Employed full-time,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
88881,88816,NaN,No,Never,"OSS is, on average, of HIGHER quality than pro...","Independent contractor, freelancer, or self-em...",NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
88882,88863,NaN,Yes,Less than once per year,"OSS is, on average, of HIGHER quality than pro...","Not employed, and not looking for work",Spain,"Yes, full-time","Professional degree (JD, MD, etc.)","Computer science, computer engineering, or sof...",...,Somewhat less welcome now than last year,Tech articles written by other developers;Indu...,18.0,Man,No,Straight / Heterosexual,Hispanic or Latino/Latina;White or of European...,No,Appropriate in length,Easy

In [67]:
df['Hobbyist']

0        Yes
1         No
2        Yes
3         No
4        Yes
        ...
88878    Yes
88879     No
88880     No
88881     No
88882    Yes
Name: Hobbyist, Length: 88883, dtype: object

In [68]:
df['Hobbyist'].map({"Yes":True, "No":False})

0         True
1        False
2         True
3        False
4         True
         ...
88878     True
88879    False
88880    False
88881    False
88882     True
Name: Hobbyist, Length: 88883, dtype: bool

In [69]:
df['Hobbyist'] = df['Hobbyist'].map({"Yes":True, "No":False})
df['Hobbyist']

0         True
1        False
2         True
3        False
4         True
         ...
88878     True
88879    False
88880    False
88881    False
88882     True
Name: Hobbyist, Length: 88883, dtype: bool